src/Documents/Вылеты/Вылеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Вылеты</name>
  <registerRecords>AccumulationRegister.ДанныеВылетов</registerRecords>
  <attributes>
    <name>ОтправлениеПлан</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоРуления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяВзлета</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрибытиеВКП</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПассажирыВзрослые</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПассажирыДети</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПассажирыМалыши</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РучнаяКладь</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Багаж</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Почта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Груз</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Регулярность</name>
    <type>
      <types>CatalogRef.ВидыПолета</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Рейс</name>
    <type>
      <types>CatalogRef.Рейсы</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерБорта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>VIPПассажирыВзрослые</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>VIPПассажирыДети</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипВС</name>
    <type>
      <types>CatalogRef.ТипыВоздушныхСудов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаЗадержки</name>
    <type>
      <types>CatalogRef.ПричиныЗадержекПрилетаВылетаВС</types>
    </type>
  </attributes>
  <attributes>
    <name>КВС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АрктикаТ1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаправленоТС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АрктикаТ4</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АэропортВылета</name>
    <type>
      <types>CatalogRef.Аэропорты</types>
    </type>
  </attributes>
  <attributes>
    <name>АэропортПрилета</name>
    <type>
      <types>CatalogRef.Аэропорты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗадержкаВылета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтменаВылета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаНевылета</name>
    <type>
      <types>CatalogRef.ПричиныНеприбытия</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьВСуточныйПлан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКресел</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершениеОбслуживания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:Document>

src/AccumulationRegisters/ДанныеВылетов/ДанныеВылетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДанныеВылетов</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>ПассажирыВзрослые</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПассажирыДети</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПассажирыМалыши</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РучнаяКладь</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Багаж</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Почта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Груз</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>VIPПассажирыВзрослые</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>VIPПассажирыДети</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>АрктикаТ1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗаправленоТС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>АрктикаТ4</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>НомерБорта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтправлениеПлан</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоРуления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяВзлета</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрибытиеВКП</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Регулярность</name>
    <type>
      <types>CatalogRef.ВидыПолета</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаЗадержки</name>
    <type>
      <types>CatalogRef.ПричиныЗадержекПрилетаВылетаВС</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаНевылета</name>
    <type>
      <types>CatalogRef.ПричиныНеприбытия</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершениеОбслуживания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Рейс</name>
    <type>
      <types>CatalogRef.Рейсы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипВС</name>
    <type>
      <types>CatalogRef.ТипыВоздушныхСудов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АэропортПрилета</name>
    <type>
      <types>CatalogRef.Аэропорты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АэропортВылета</name>
    <type>
      <types>CatalogRef.Аэропорты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗадержкаВылета</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОтменаВылета</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/InformationRegisters/КоличествоКреселБортов/КоличествоКреселБортов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КоличествоКреселБортов</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>КоличествоКресел</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>НомерБорта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/Вылеты/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр Данные Вылетов
	Движения.ДанныеВылетов.Записывать = Истина;
	Движение = Движения.ДанныеВылетов.Добавить();
	Движение.Период = Дата;
	Движение.Рейс = Рейс;
	Движение.Дата = Дата(Дата);
	Движение.ПассажирыВзрослые = ПассажирыВзрослые;
	Движение.ПассажирыДети = ПассажирыДети;
	Движение.ПассажирыМалыши = ПассажирыМалыши;
	Движение.РучнаяКладь = РучнаяКладь;
	Движение.Багаж = Багаж;
	Движение.Почта = Почта;
	Движение.Груз = Груз;
	Движение.НомерБорта = НомерБорта;
	Движение.ОтправлениеПлан = ОтправлениеПлан;
	Движение.НачалоРуления = НачалоРуления;
	Движение.ВремяВзлета = ВремяВзлета;
	Движение.ПрибытиеВКП = ПрибытиеВКП;
	Движение.Регулярность = Регулярность;
	Движение.Примечание = Примечание;
	Движение.VIPПассажирыВзрослые = VIPПассажирыВзрослые;
	Движение.VIPПассажирыДети = VIPПассажирыДети;
	Движение.ТипВС = ТипВС;
	Движение.АрктикаТ1 = АрктикаТ1;
	Движение.АрктикаТ4 = АрктикаТ4;
	Движение.ЗаправленоТС = ЗаправленоТС;
	Движение.АэропортПрилета = АэропортПрилета;
	Движение.АэропортВылета = АэропортВылета;
	Движение.ЗадержкаВылета = ЗадержкаВылета;
	Движение.ПричинаЗадержки = ПричинаЗадержки;
	Движение.ОтменаВылета = ОтменаВылета;
	Движение.ПричинаНевылета = ПричинаНевылета;
	Движение.ЗавершениеОбслуживания = ЗавершениеОбслуживания;
	
	//регистр Количество кресел бортов
	Запрос = Новый Запрос;

	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КоличествоКреселБортовСрезПоследних.КоличествоКресел КАК КоличествоКресел
		|ИЗ
		|	РегистрСведений.КоличествоКреселБортов.СрезПоследних(&Дата, НомерБорта = &НомерБорта) КАК КоличествоКреселБортовСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("НомерБорта", НомерБорта);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		МенеджерЗаписи = РегистрыСведений.КоличествоКреселБортов.СоздатьМенеджерЗаписи(); 
		МенеджерЗаписи.Период = Дата; 
		МенеджерЗаписи.НомерБорта = НомерБорта; 
		МенеджерЗаписи.КоличествоКресел = КоличествоКресел; 
		МенеджерЗаписи.Записать(); 		
	Иначе
		Результат = Запрос.Выполнить().Выбрать();	
		Результат.Следующий();
		Если КоличествоКресел <> Результат.КоличествоКресел Тогда  
			МенеджерЗаписи = РегистрыСведений.КоличествоКреселБортов.СоздатьМенеджерЗаписи(); 
			МенеджерЗаписи.Период = Дата; 
			МенеджерЗаписи.НомерБорта = НомерБорта; 
			МенеджерЗаписи.КоличествоКресел = КоличествоКресел; 
			МенеджерЗаписи.Записать();	 		
		КонецЕсли;
	КонецЕсли; 
	
	
КонецПроцедуры
